import sqlite3

categories = ['Троянда', 'Яблуня', 'Смородина', 'Тюльпан', 'Сосна', 'Барвінок', 'Лаванда', 
              'Шавлія', 'Лілія', 'Ромашка', 'Жасмин', 'Гортензія', 'Жоржина', 'Верес', 'Бузок', 
              'Гладіолус', 'Суниця', 'Малина', 'Агрус', 'Глід', 'Сирень', 'Трава', 'Пшениця', 'Райграс', 
              'Конюшина', 'Півонія', 'Нарцис', 'Фіалка', 'Братки', 'Калина', 'Груша', 'Абрикос', 
              'Вишня', 'Слива', 'Чорниця', 'Береза', 'Тис', 'Форзиція', 'Ялівець', 'Мох', 'Тимофіївка', 
              'Чай', 'Орхідея', 'Флокс', 'Жовтець', 'Зірка', 'Роза']

descriptions = [
    "Символ краси та любові, широко використовується в ландшафтному дизайні.",
    "Цінне плодове дерево, що приносить сочні плоди, важливе для садівництва.",
    "Кущ з чорними ягодами, багатими на вітаміни, популярний для вирощування в садах.",
    "Весняна квітка з яскравими пелюстками, улюблена багатьма садівниками.",
    "Хвойне дерево, стійке до холоду, ідеальне для створення зелених зон.",
    "Зелений кущ, часто використовується для живоплотів, привносить свіжість у садові композиції.",
    "Цей квітучий кущ знаменитий своїм ароматом, який заспокоює та релаксує.",
    "Лікарська рослина з фіолетовими квітами, використовується у народній медицині.",
    "Елегантна квітка з великими пелюстками, часто використовується у флористиці.",
    "Маленька квітка з білими пелюстками та жовтою серединою, популярна у народній медицині.",
    "Кущ з ароматними білими квітами, відомий своїми розслаблюючими властивостями.",
    "Декоративний кущ з пишними квітами, який може змінювати колір залежно від кислотності ґрунту.",
    "Квітка осіннього періоду з великими різнобарвними суцвіттями, популярна для садових композицій.",
    "Низькорослий кущ з фіолетовими квітами, ідеальний для створення контрасту в саду.",
    "Кущ з ароматними квітами, використовується для створення приємної атмосфери в садах.",
    "Квітка з довгими стеблами і яскравими суцвіттями, чудово підходить для літніх клумб.",
    "Ягідна рослина з солодкими плодами, любима багатьма за її високий смак.",
    "Кущ з яскраво-червоними ягодами, популярний для вживання в їжу та приготування варення.",
    "Ягідний кущ з кислими плодами, використовується в кулінарії для приготування напоїв.",
    "Дерево з червоними плодами, має високу декоративність і лікарські властивості.",
    "Кущ з пишними квітами, який створює чудовий аромат у саду.",
    "Трава для газонів, ідеально підходить для створення рівних зелених покриттів.",
    "Зернова культура, часто використовується для декоративних цілей у ландшафтному дизайні.",
    "Трава, що відома своєю стійкістю та здатністю швидко відновлюватись, популярна для газонів.",
    "Декоративна трава з білими квітами, поліпшує структуру ґрунту, приваблює корисних комах.",
    "Багаторічний кущ з великими квітами, популярний у дизайні садових композицій.",
    "Весняна квітка, відома своїми яскравими жовтими квітами, символ нового початку.",
    "Маленька квітка з приємним ароматом, використовується в парфумерії.",
    "Різнокольорові квіти, ідеальні для створення яскравих клумб і рабаток.",
    "Кущ з лікарськими ягодами, використовується у традиційній медицині для приготування ліків.",
    "Плодове дерево з соковитими плодами, важливе для домашнього садівництва.",
    "Дерево з яскравими помаранчевими плодами, використовується в кулінарії.",
    "Дерево з кислими червоними плодами, використовується для виготовлення консервів.",
    "Дерево з соковитими фіолетовими плодами, відоме своєю вкусовою якістю.",
    "Кущ з синіми ягодами, популярний завдяки своїм антиоксидантним властивостям.",
    "Декоративне дерево з яскравою корою, широко використовується у ландшафтному дизайні.",
    "Хвойний кущ, відомий своєю довговічністю та декоративними ягодами.",
    "Кущ, що цвіте навесні яскраво-жовтими квітами, символ весняного оновлення.",
    "Хвойний кущ, популярний для створення низьких живоплотів.",
    "Вид моху, створює щільне зелене покриття, ідеальне для тінистих місць.",
    "Трава, що використовується для створення міцних газонів, відома своєю витривалістю.",
    "Декоративний кущ з яскраво-желтими квітами, часто використовується для створення яскравих акцентів у саду.",
    "Екзотична квітка з незвичайними пелюстками, створює тропічну атмосферу.",
    "Квітка з пишними суцвіттями, відома своєю невибагливістю і тривалим цвітінням.",
    "Маленька квітка з яскраво-жовтими пелюстками, використовується для створення сонячних клумб.",
    "Однорічна квітка, відома своїм швидким ростом і яскравим цвітінням.",
    "Квітка, символізує любов, часто використовується в квітниках."
]

def add_task(conn, task):
    sql = '''INSERT INTO content_plant_genus(genus_name, genus_description)
             VALUES(?,?) '''
    cur = conn.cursor()
    cur.execute(sql, task)
    conn.commit()
    cur.close()


with sqlite3.connect('db.sqlite3') as conn:
    for i in range(0, len(categories)):
        add_task(conn, [categories[i], descriptions[i]])
conn.close()
