import sqlite3
import random

suppliers = [1] * 75 + [2] * 30 + [3] * 20
random.shuffle(suppliers)


plants_list = [
    ['Троянда садова', 'Саженцы декоративных кустарников и деревьев', 'троянда', 'Цей кущ привертає увагу своїми великими квітами, підходить для прикрашання саду та створення яскравих акцентів у квітниках.', 120.0, 15],
    ['Яблуня червона', 'Саженцы плодовитых деревьев и кустарников', 'яблуня', 'Вирощувана за яскраво-червоні соковиті плоди, це дерево стане справжньою прикрасою будь-якого саду, а яблука можна використовувати для приготування десертів та заготовок.', 150.5, 0],
    ['Смородина чорна', 'Саженцы плодовитых деревьев и кустарников', 'смородина', 'Відомий своїми вітамінами кущ дає урожай чорних ягід, які ідеально підходять для домашнього варення та здорового харчування.', 75.25, 13],
    ['Тюльпан весняний', 'Семена и луковицы цветов', 'тюльпан', 'Ця рослина прикрашає сади своїм яскравим цвітінням навесні, приносячи свіжість та красу у перші теплі дні.', 40.4, 11],
    ['Сосна карликова', 'Саженцы декоративных кустарников и деревьев', 'сосна', 'Чудове рішення для ландшафтного дизайну, ця вічнозелена рослина прикрашає сад круглий рік завдяки своєму невисокому зросту та пишній зелені.', 90.0, 9],
    ['Барвінок зелений', 'Саженцы декоративных кустарников и деревьев', 'барвінок', 'Часто використовується для створення щільних та живих огорож, цей кущ вносить зелений колір та свіжість у будь-який куточок саду.', 35.35, 23],
    ['Лаванда лікарська', 'Семена и луковицы цветов', 'лаванда', 'Зі своїм унікальним ароматом, ця квітка широко використовується в ароматерапії та як декоративна прикраса садів.', 50.5, 3],
    ['Шавлія мускатна', 'Семена и луковицы цветов', 'шавлія', 'Фіолетові квіти цієї лікарської рослини не тільки красиво виглядають, але й використовуються у народній медицині для приготування цілющих настоїв.', 45.45, 40],
    ['Лілія біла', 'Семена и луковицы цветов', 'лілія', 'З великими пелюстками, ці квіти додають елегантності та шарму будь-якому садовому простору, часто використовуються у дизайні та для букетів.', 55.55, 23],
    ['Ромашка садова', 'Семена и луковицы цветов', 'ромашка', 'Ця маленька квітка з яскраво вираженою білою та жовтою забарвленням популярна для садових композицій та як лікарська рослина.', 30.3, 6],
    ['Жасмин ароматний', 'Саженцы декоративных кустарников и деревьев', 'жасмин', 'Відомий своїми інтенсивними ароматичними властивостями, цей кущ ідеальний для створення живих огорож та ароматичних куточків.', 85.85, 39],
    ['Гортензія рожевобуза', 'Саженцы декоративных кустарников и деревьев', 'гортензія', 'З пишними рожевими суцвіттями, цей кущ є улюбленцем багатьох садівників за його красу та здатність змінювати колір залежно від грунту.', 65.65, 49],
    ['Жоржина осіння', 'Семена и луковицы цветов', 'жоржина', 'Осінні місяці оживають завдяки цій рослині з великими, яскравими та багатокольоровими квітами, роблячи її центром уваги будь-якої осінньої клумби.', 70.7, 37],
    ['Верес фіолетовий', 'Саженцы декоративных кустарников и деревьев', 'верес', 'Цей низькорослий кущ з фіолетовими квітами ідеальний для створення контрастних клумб та пейзажів.', 25.25, 16],
    ['Бузок білий', 'Саженцы декоративных кустарников и деревьев', 'бузок', 'Ніжні білі квіти цього куща не тільки радують око, але і наповнюють повітря солодким ароматом, роблячи його популярним вибором для садів.', 95.95, 39],
    ['Гладіолус ранній', 'Семена и луковицы цветов', 'гладіолус', 'Ці квіти з довгими стеблами та яскравими суцвіттями стають помітною прикрасою будь-якої літньої клумби, додаючи вертикальні акценти.', 35.0, 45],
    ['Суниці лісові', 'Саженцы плодовитых деревьев и кустарников', 'суниця', 'Улюблені багатьма за їхній солодкий смак, ці ягоди також є красивим доповненням до садового ландшафту, приваблюючи птахів та комах.', 30.0, 11],
    ['Малина червона', 'Саженцы плодовитых деревьев и кустарников', 'малина', "Кущ, усипаний яскраво-червоними ягодами, відомий не тільки своїм смаком, але й користю для здоров'я, популярний для домашніх заготовок.", 50.0, 37],
    ['Агрус зелений', 'Саженцы плодовитых деревьев и кустарников', 'агрус', 'Ці кислі ягоди чудово підходять для приготування компотів та варення, а кущі прикрашають сад своєю пишною зеленню та цвітінням.', 40.4, 0],
    ['Глід червоний', 'Саженцы плодовитых деревьев и кустарников', 'глід', 'Це дерево не тільки красиво виглядає завдяки своїм червоним плодам, але й використовується у народній медицині, будучи джерелом корисних речовин.', 80.8, 11],
    ['Сирень садова', 'Саженцы декоративных кустарников и деревьев', 'сирень', 'Пишне цвітіння цього куща у весняний період приваблює погляди, а його аромат огортає сад, створюючи атмосферу затишку та краси.', 100.0, 26],
    ['Трава газонна', 'Семена газонной травы', 'трава', 'Ідеальний вибір для створення доглянутих газонів, ця низькоросла трава формує щільне зелене покриття, надаючи ландшафту завершений вигляд.', 15.15, 45],
    ['Пшениця декоративна', 'Семена газонной травы', 'пшениця', 'Зернова культура використовується не тільки в аграрному секторі, але й для створення оригінальних декоративних композицій у саду.', 10.1, 15],
    ['Райграс пасовищний', 'Семена газонной травы', 'райграс', 'Ця багаторічна трава формує густі зелені луки, ідеально підходящі для створення довговічних та стійких газонів.', 20.2, 24],
    ['Конюшина біла', 'Семена газонной травы', 'конюшина', 'Ця трава з білими квітами не тільки красива, але й корисна, покращуючи структуру грунту та приваблюючи корисних комах у сад.', 25.25, 29],
    ['Півонія садова', 'Семена и луковицы цветов', 'півонія', 'Великі та пишні квіти цього куща стають яскравою прикрасою будь-якого саду, приваблюючи увагу своєю красою та вишуканістю.', 85.0, 24],
    ['Нарцис жовтий', 'Семена и луковицы цветов', 'нарцис', 'Весняне цвітіння цих яскравих та радісних квітів вносить свіжість та нове життя у садові композиції після зимового періоду.', 35.35, 3],
    ['Фіалка нічна', 'Семена и луковицы цветов', 'фіалка', 'Маленькі, але дуже ароматні квіти цієї культури роблять її популярним вибором для вечірніх та нічних садів, де можна насолоджуватися їхнім запахом.', 45.45, 19],
    ['Братки садові', 'Семена и луковицы цветов', 'братки', 'Яскраві та багатокольорові квіти цієї культури ідеально підходять для створення кольорових клумб та рабаток, додаючи різноманіття кольорів та форм.', 20.2, 48],
    ['Калина червона', 'Саженцы плодовитых деревьев и кустарников', 'калина', 'Кущ з червоними ягодами, відомий своїми лікувальними властивостями, додає яскраві акценти до садового дизайну та користується популярністю в народній медицині.', 55.0, 45],
    ['Груша лісова', 'Саженцы плодовитых деревьев и кустарников', 'груша', 'Плодове дерево з смачними та соковитими плодами, ідеально підходить для вирощування у прибудинкових ділянках та городах.', 120.0, 33],
    ['Абрикос садовий', 'Саженцы плодовитых деревьев и кустарников', 'абрикос', 'Це дерево з сонячними, яскраво-помаранчевими плодами прикрашає сад і дарує смачні плоди, які можна використовувати у домашньому консервуванні.', 150.0, 47],
    ['Вишня кисла', 'Саженцы плодовитых деревьев и кустарников', 'вишня', 'Кислуваті плоди цього дерева чудово підходять для приготування компотів та варення, а яскраві червоні ягоди додають краси саду.', 130.0, 31],
    ['Слива садова', 'Саженцы плодовитых деревьев и кустарников', 'слива', 'Соковиті та солодкі фіолетові плоди цього дерева не тільки смачні, але й надають вишуканості садовим композиціям.', 120.0, 11],
    ['Чорниця звичайна', 'Саженцы плодовитых деревьев и кустарников', 'чорниця', 'Кущ з темно-синіми ягодами, багатими антиоксидантами, популярний як для свіжого вживання, так і для домашнього консервування.', 85.85, 41],
    ['Груша декоративна', 'Саженцы декоративных кустарников и деревьев', 'груша', 'З компактною кроною, це дерево ідеально підходить для малих садів та міських умов, створюючи естетично приємні куточки.', 160.0, 26],
    ['Береза біла', 'Саженцы декоративных кустарников и деревьев', 'береза', 'Світла кора цього дерева красиво контрастує з зеленим листям, роблячи його популярним вибором для парків і садів.', 90.0, 44],
    ['Тис ягідний', 'Саженцы декоративных кустарников и деревьев', 'тис', 'Вічнозелений кущ з червоними ягодами додає яскравих кольорів у зимовий сад і є відмінним вибором для живих огорож.', 80.0, 16],
    ['Форзиція жовта', 'Саженцы декоративных кустарников и деревьев', 'форзиція', 'Навесні цей кущ покривається яскраво-жовтими квітами, стаючи одним із перших вісників весни у саду.', 40.0, 32],
    ['Ялівець козацький', 'Саженцы декоративных кустарников и деревьев', 'ялівець', 'Хвойний кущ, який відрізняється своєю стійкістю та невибагливістю у догляді, чудово підходить для створення низьких огорож.', 25.25, 22],
    ['Мох газонний', 'Семена газонной травы', 'мох', "Цей вид моху створює щільне та м'яке зелене покриття, чудово підходить для тінистих ділянок саду.", 45.0, 5],
    ['Тимофіївка лучна', 'Семена газонной травы', 'тимофіївка', 'Ця трава чудово підходить для створення пасовищ та стійких газонів, завдяки своїй здатності швидко відновлюватися після витоптування.', 75.75, 31],
    ['Курильський чай', 'Саженцы декоративных кустарников и деревьев', 'чай', 'Декоративний кущ з яскраво-жовтими квітами, часто використовується у садах для створення яскравих акцентів та як медоносна рослина.', 60.6, 27],
    ['Бузок махровий', 'Саженцы декоративных кустарников и деревьев', 'бузок', 'З пишними махровими квітами, цей кущ є улюбленим вибором для багатьох садівників завдяки своїй декоративності та аромату.', 40.4, 41],
    ['Орхідея садова', 'Семена и луковицы цветов', 'орхідея', 'Екзотична рослина з яскравими та незвичайними квітами, чудово підходить для створення тропічної атмосфери у саду.', 10.1, 20],
    ['Флокс садовий', 'Семена и луковицы цветов', 'флокс', 'Квітка з пишними суцвіттями різних відтінків, улюблена багатьма за свою невибагливість та тривале цвітіння.', 20.2, 43],
    ['Жовтець садовий', 'Семена и луковицы цветов', 'жовтець', 'Маленька квітка з яскраво-жовтими пелюстками, часто використовується для створення яскравих та сонячних клумб у саду.', 35.35, 42],
    ['Зірка однорічна', 'Семена и луковицы цветов', 'зірка', 'Однорічна рослина, яка ідеально підходить для швидкого створення квіткових композицій, завдяки своєму яскравому та тривалому цвітінню.', 70.7, 19],
    ['Лаванда полева', 'Семена и луковицы цветов', 'лаванда', 'Цей вид лаванди з його унікальним ароматом широко використовується для ароматерапії та як прикраса садів.', 60.0, 20],
    ['Яблуня зелена', 'Саженцы плодовитых деревьев и кустарников', 'яблуня', 'Це дерево вирощують за зелені соковиті плоди, які можна використовувати для приготування різноманітних страв.', 165.5, 12],
    ['Смородина біла', 'Саженцы плодовитых деревьев и кустарников', 'смородина', 'Відома своїми корисними властивостями, ця кущова культура дає урожай білих ягід, використовуваних у домашньому консервуванні.', 80.0, 18],
    ['Тюльпан літній', 'Семена и луковицы цветов', 'тюльпан', "Цей сорт тюльпанів квітне влітку, додаючи різнобарв'я та свіжість до садових композицій.", 45.0, 16],
    ['Сосна висока', 'Саженцы декоративных кустарников и деревьев', 'сосна', 'Ця висока сосна ідеально підходить для великих ландшафтних дизайнів, додаючи зелені акценти в простір навколо.', 120.0, 5],
    ['Барвінок блакитний', 'Саженцы декоративных кустарников и деревьев', 'барвінок', 'Цей вид барвінка з блакитними квітами ефектно виглядає в садових композиціях, використовуючись для створення живоплотів.', 38.0, 30],
    ['Шавлія лікарська', 'Семена и луковицы цветов', 'шавлія', 'Цей вид шавлії з яскравими квітами широко використовується в медицині та як декоративне рослина у садах.', 55.0, 25],
    ['Лілія рожева', 'Семена и луковицы цветов', 'лілія', 'Ця квітка з великими рожевими пелюстками є вишуканою прикрасою будь-якого саду.', 65.0, 17],
    ['Ромашка полева', 'Семена и луковицы цветов', 'ромашка', 'Ця дика ромашка з виразними білими пелюстками і жовтим серцевином чудово підходить для натуралістичних садів.', 28.0, 14],
    ['Жасмин пізній', 'Саженцы декоративных кустарников и деревьев', 'жасмин', 'Цей сорт жасмину квітне пізно влітку, наповнюючи сад своїм неперевершеним ароматом.', 88.0, 21],
    ['Гортензія блакитна', 'Саженцы декоративных кустарников и деревьев', 'гортензія', 'Ця гортензія з блакитними квітами є дуже популярною через свою здатність адаптуватися до різних типів грунтів.', 72.0, 34],
    ['Жоржина весняна', 'Семена и луковицы цветов', 'жоржина', 'Цей ранньоквітучий сорт жоржин приносить яскравість у весняні сади зі своїми кольоровими пелюстками.', 77.0, 29],
    ['Верес осінній', 'Саженцы декоративных кустарников и деревьев', 'верес', 'Цей верес квітне восени, додаючи саду яскраві фіолетові акценти під час холодних місяців.', 30.0, 8],
    ['Бузок рожевий', 'Саженцы декоративных кустарников и деревьев', 'бузок', 'Цей сорт бузку з рожевими квітами створює чудові ароматичні акценти у весняному саду.', 105.0, 22],
    ['Гладіолус осінній', 'Семена и луковицы цветов', 'гладіолус', 'Цей сорт гладіолусу квітне восени, прикрашаючи сад своїми яскравими суцвіттями на тлі опадаючих листя.', 40.0, 18],
    ['Суниця садова', 'Саженцы плодовитых деревьев и кустарников', 'суниця', 'Ця суниця приносить великі ягоди, що ідеально підходять для свіжого вживання та заготовок.', 35.0, 25],
    ['Малина жовта', 'Саженцы плодовитых деревьев и кустарников', 'малина', 'Цей сорт малини дає яскраво-жовті ягоди, які є солодкими та соковитими, популярними для садового вирощування.', 55.0, 20],
    ['Агрус червоний', 'Саженцы плодовитых деревьев и кустарников', 'агрус', 'Цей вид агрусу має яскраво-червоні ягоди, які чудово підходять для виготовлення джемів та желе.', 42.0, 15],
    ['Глід білий', 'Саженцы плодовитых деревьев и кустарников', 'глід', 'Цей вид глоду з білими плодами використовується для декоративних цілей і має цілющі властивості.', 83.0, 10],
    ['Сирень блакитна', 'Саженцы декоративных кустарников и деревьев', 'сирень', 'Ця сирень з блакитними квітами зачаровує своїм виглядом та ароматом, є популярною серед садівників.', 102.0, 19],
    ['Трава польова', 'Семена газонной травы', 'трава', 'Ця польова трава створює природний вигляд газону, ідеально підходить для екологічних ландшафтних дизайнів.', 18.0, 50],
    ['Пшениця садова', 'Семена газонной травы', 'пшениця', 'Ця декоративна пшениця використовується для створення унікальних зелених композицій у саду, додаючи текстуру ландшафту.', 12.0, 28],
    ['Райграс декоративний', 'Семена газонной травы', 'райграс', 'Цей декоративний райграс формує щільне зелене покриття, чудово підходить для використання на спортивних полях.', 22.0, 35],
    ['Конюшина рожева', 'Семена газонной травы', 'конюшина', 'Ця конюшина з рожевими квітами створює яскраві акценти на газоні, також приваблює бджіл та інших корисних комах.', 27.0, 40],
    ['Півонія біла', 'Семена и луковицы цветов', 'півонія', 'Ця півонія з великими білими квітами є величною прикрасою для будь-якого саду, зачаровуючи своєю красою.', 90.0, 12],
    ['Нарцис блакитний', 'Семена и луковицы цветов', 'нарцис', 'Цей рідкісний сорт нарцисів з блакитними квітами вносить унікальність у весняні садові композиції.', 38.0, 15],
    ['Фіалка денна', 'Семена и луковицы цветов', 'фіалка', 'Ця фіалка квітне вдень, маючи яскраві квіти, які є чудовим вибором для прикраси клумб і бордюрів.', 50.0, 18],
    ['Братки осінні', 'Семена и луковицы цветов', 'братки', 'Ці осінні братки мають яскраве забарвлення і продовжують квітувати навіть з похолоданням, роблячи їх популярними для осіннього декору.', 21.0, 24],
    ['Калина жовта', 'Саженцы плодовитых деревьев и кустарников', 'калина', 'Ця калина з жовтими ягодами відома своїми лікувальними властивостями і яскраво вираженим кольором, що додає контрасту в саду.', 58.0, 22],
    ['Груша садова', 'Саженцы плодовитых деревьев и кустарников', 'груша', 'Це дерево з великими і соковитими плодами стане чудовим доповненням до будь-якого саду, виробляючи плоди для свіжого споживання та консервації.', 125.0, 14],
    ['Абрикос ранній', 'Саженцы плодовитых деревьев и кустарников', 'абрикос', 'Цей ранній сорт абрикоса дає плоди, які відомі своєю солодкістю та ароматом, чудово підходять для раннього літнього врожаю.', 155.0, 18],
    ['Вишня солодка', 'Саженцы плодовитых деревьев и кустарников', 'вишня', 'Ця вишня виробляє солодкі червоні ягоди, які чудово підходять для споживання в свіжому вигляді та для приготування десертів.', 135.0, 19],
    ['Слива весняна', 'Саженцы плодовитых деревьев и кустарников', 'слива', 'Ця ранньоквітуча слива приносить плоди весною, що робить її популярною серед садівників, які бажають раннього врожаю.', 123.0, 16],
    ['Чорниця великоплідна', 'Саженцы плодовитых деревьев и кустарников', 'чорниця', 'Цей сорт чорниці виробляє великі ягоди, багаті на антиоксиданти, ідеальні для домашнього консервування та свіжого споживання.', 90.0, 30],
    ['Груша паркова', 'Саженцы декоративных кустарников и деревьев', 'груша', 'Ця груша з великими декоративними плодами відмінно підходить для паркових умов, де може слугувати як естетичний, так і практичний елемент.', 170.0, 12],
    ['Береза чорна', 'Саженцы декоративных кустарников и деревьев', 'береза', 'Ця рідкісна форма берези з темною корою створює вражаючий контраст у саду, ідеально підходить для акцентування ландшафтних дизайнів.', 95.0, 30],
    ['Тис золотистий', 'Саженцы декоративных кустарников и деревьев', 'тис', 'Цей тис з золотистими ягодами є чудовим доповненням до зимового саду, додаючи кольору в холодні місяці.', 85.0, 11],
    ['Форзиція рання', 'Саженцы декоративных кустарников и деревьев', 'форзиція', 'Ця форзиція, що цвіте рано навесні, відома своїми яскравими жовтими квітами, що робить її однією з перших прикрас весняного саду.', 43.0, 25],
    ['Ялівець сріблястий', 'Саженцы декоративных кустарников и деревьев', 'ялівець', 'Цей сорт ялівцю з сріблястими голками чудово вписується в будь-які ландшафтні дизайни, забезпечуючи стійкість і довговічність.', 28.0, 14],
    ['Мох лісовий', 'Семена газонной травы', 'мох', "Цей вид лісового моху ідеально підходить для створення натуралістичних композицій в тінистих куточках саду, надаючи їм м'якості та природності.", 48.0, 8],
    ['Тимофіївка полівна', 'Семена газонной травы', 'тимофіївка', 'Ця трава ідеально підходить для створення міцних і здорових газонів, забезпечуючи щільне зелене покриття, стійке до зносу.', 77.0, 22],
    ['Курильський чай червоний', 'Саженцы декоративных кустарников и деревьев', 'чай', 'Цей декоративний кущ з червоними квітами часто використовується у садах для створення яскравих акцентів та як медоносне рослина.', 62.0, 18],
    ['Бузок жовтий', 'Саженцы декоративных кустарников и деревьев', 'бузок', 'Цей рідкісний жовтий бузок є вишуканою прикрасою для будь-якого саду, зачаровуючи своєю красою і ароматом.', 42.0, 29],
    ['Орхідея полівна', 'Семена и луковицы цветов', 'орхідея', 'Ця дика орхідея з яскравими квітами прикрашає природні ландшафти та ідеально підходить для садових композицій.', 12.0, 15],
    ['Флокс ранній', 'Семена и луковицы цветов', 'флокс', "Цей сорт флоксу квітне рано весною, надаючи саду різнобарв'я та свіжість.", 23.0, 31],
    ['Жовтець весняний', 'Семена и луковицы цветов', 'жовтець', 'Цей весняний жовтець з яскраво-жовтими квітами ідеально підходить для створення сонячних клумб.', 38.0, 25],
    ['Зірка тривала', 'Семена и луковицы цветов', 'зірка', 'Це багаторічне рослина з довгим періодом цвітіння прикрашає сад своїми яскравими квітами, забезпечуючи красу тривалою весною і літом.', 73.0, 10],
    ['Роза паркова', 'Саженцы декоративных кустарников и деревьев', 'роза', 'Ця паркова роза вирощується для створення великих квітучих масивів, стійка до хвороб і низьких температур.', 130.0, 34],
    ['Яблуня зимова', 'Саженцы плодовитых деревьев и кустарников', 'яблуня', 'Ця яблуня вирощується за її здатність зберігати плоди протягом усієї зими, ідеальна для холодного клімату.', 160.0, 12],
    ['Тюльпан пізній', 'Семена и луковицы цветов', 'тюльпан', 'Цей сорт тюльпанів квітне в кінці весни, даруючи яскравість і кольорові акценти в саду після інших ранніх квітів.', 42.0, 30],
    ['Сосна гірська', 'Саженцы декоративных кустарников и деревьев', 'сосна', 'Ця гірська сосна відома своєю стійкістю до вітрів та низьких температур, часто використовується в альпійських гірських композиціях.', 95.0, 14],
    ['Барвінок синій', 'Саженцы декоративных кустарников и деревьев', 'барвінок', 'Цей вид барвінку з синіми квітами використовується для створення красивих і живих килимів на садових ділянках.', 38.0, 18],
    ['Лаванда дикий', 'Семена и луковицы цветов', 'лаванда', 'Цей дикий вид лаванди вирощується за його неперевершений природний аромат і міцність в умовах малого догляду.', 52.0, 22],
    ['Шавлія червона', 'Семена и луковицы цветов', 'шавлія', 'Ця шавлія з яскраво-червоними квітами використовується в садовому дизайні для створення контрастних кольорових плям.', 47.0, 25],
    ['Лілія жовта', 'Семена и луковицы цветов', 'лілія', 'Ця яскрава лілія з великими жовтими квітами є чудовим доповненням до будь-якої клумби або квітника.', 60.0, 19],
    ['Ромашка полівна', 'Семена и луковицы цветов', 'ромашка', 'Ця ромашка вирощується на полях і використовується як лікарська та декоративна рослина.', 33.0, 40],
    ['Жасмин нічний', 'Саженцы декоративных кустарников и деревьев', 'жасмин', 'Цей жасмин відомий своїм сильним вечірнім ароматом, ідеально підходить для вечірніх ароматних садів.', 88.0, 16],
    ['Гортензія синя', 'Саженцы декоративных кустарников и деревьев', 'гортензія', 'Ця гортензія з синіми квітами змінює колір залежно від кислотності грунту, створюючи вражаючі візуальні ефекти в саду.', 68.0, 21],
    ['Жоржина зимова', 'Семена и луковицы цветов', 'жоржина', 'Ця жоржина має здатність зберігати свої квіти до пізньої осені, продовжуючи квітучий сезон в саду.', 75.0, 13],
    ['Верес сріблястий', 'Саженцы декоративных кустарников и деревьев', 'верес', 'Цей верес з сріблястими квітами відомий своєю стійкістю до сухих умов, ідеально підходить для сухих ландшафтів.', 28.0, 17],
    ['Суниця гірська', 'Саженцы плодовитых деревьев и кустарников', 'суниця', 'Ця суниця з гірських регіонів відома своїм насиченим смаком і стійкістю до холоду, чудово підходить для високогірних садів.', 35.0, 14],
    ['Малина золота', 'Саженцы плодовитых деревьев и кустарников', 'малина', 'Ця малина виробляє золотисті ягоди, які мають унікальний смак і високу популярність серед гурманів.', 53.0, 23],
    ['Агрус сріблястий', 'Саженцы плодовитых деревьев и кустарников', 'агрус', 'Цей агрус з сріблястими ягодами вирощується для декоративних та кулінарних цілей, стійкий до більшості захворювань.', 41.0, 19],
    ['Глід помаранчевий', 'Саженцы плодовитых деревьев и кустарников', 'глід', 'Цей глід з помаранчевими плодами використовується не тільки для декору, але і в народній медицині.', 83.0, 12],
    ['Сирень лимонна', 'Саженцы декоративных кустарников и деревьев', 'сирень', 'Ця сирень з лимонно-жовтими квітами вносить яскравість і відчуття свіжості в будь-який садовий ландшафт.', 105.0, 25],
    ['Трава річкова', 'Семена газонной травы', 'трава', 'Ця трава, ідеальна для берегів річок і ставків, створює міцне і стійке до вологи покриття.', 18.0, 33],
    ['Пшениця гірська', 'Семена газонной травы', 'пшениця', 'Ця пшениця, пристосована до високогірних умов, використовується для створення унікальних ландшафтних композицій.', 12.0, 21],
    ['Райграс південний', 'Семена газонной травы', 'райграс', 'Цей райграс, відомий своєю здатністю витримувати високі температури, ідеально підходить для гарячих кліматичних зон.', 21.0, 28],
    ['Конюшина пурпурна', 'Семена газонной травы', 'конюшина', 'Ця конюшина з пурпурними квітами не тільки красива, але й корисна, поліпшуючи структуру грунту і залучаючи бджіл.', 26.0, 15],
    ['Нарцис синій', 'Семена и луковицы цветов', 'нарцис', 'Цей нарцис з рідкісними синіми квітами прикрашає весняні композиції, додаючи унікальність і новизну.', 37.0, 12],
    ['Фіалка рання', 'Семена и луковицы цветов', 'фіалка', "Ця фіалка, квітне ранньою весною, наповнюючи сад своїм ніжним ароматом і м'якими кольорами.", 46.0, 22],
    ['Братки жовті', 'Семена и луковицы цветов', 'братки', 'Ці яскраво-жовті братки ідеально підходять для створення кольорових акцентів у весняних і літніх клумбах.', 24.0, 40],
    ['Калина золота', 'Саженцы плодовитых деревьев и кустарников', 'калина', 'Ця калина з золотистими ягодами відома своїми оздоровчими властивостями, створюючи яскраві акценти в садовому дизайні.', 58.0, 30],
    ['Груша південна', 'Саженцы плодовитых деревьев и кустарников', 'груша', 'Ця груша вирощується в південних регіонах і відома своїми соковитими і солодкими плодами, ідеальними для споживання в свіжому вигляді.', 125.0, 16],
    ['Абрикос північний', 'Саженцы плодовитых деревьев и кустарников', 'абрикос', 'Цей абрикос пристосований до холодних кліматічних умов, виробляючи якісні плоди, які відмінно підходять для консервування.', 155.0, 21],
    ['Вишня дика', 'Саженцы плодовитых деревьев и кустарников', 'вишня', 'Ця дика вишня виробляє яскраві і кислі плоди, які використовуються для виготовлення варення та інших кулінарних делікатесів.', 135.0, 19],
    ['Слива лісова', 'Саженцы плодовитых деревьев и кустарников', 'слива', 'Ця слива, вирощувана в лісових умовах, відома своїми соковитими та ароматними плодами, які використовуються як у свіжому, так і в переробленому вигляді.', 125.0, 17],
]

replacements = {
    "Саженцы декоративных кустарников и деревьев" : 'Саджанці декоративних чагарників і дерев',
    "Саженцы плодовитых деревьев и кустарников" : 'Саджанці плодових дерев і чагарників',
    "Семена и луковицы цветов" : 'Насіння і цибулини квітів',
    "Семена газонной травы" : 'Насіння газонної трави'
}

categories = ['Троянда', 'Яблуня', 'Смородина', 'Тюльпан', 'Сосна', 'Барвінок', 'Лаванда', 
              'Шавлія', 'Лілія', 'Ромашка', 'Жасмин', 'Гортензія', 'Жоржина', 'Верес', 'Бузок', 
              'Гладіолус', 'Суниця', 'Малина', 'Агрус', 'Глід', 'Сирень', 'Трава', 'Пшениця', 'Райграс', 
              'Конюшина', 'Півонія', 'Нарцис', 'Фіалка', 'Братки', 'Калина', 'Груша', 'Абрикос', 
              'Вишня', 'Слива', 'Чорниця', 'Береза', 'Тис', 'Форзиція', 'Ялівець', 'Мох', 'Тимофіївка', 
              'Чай', 'Орхідея', 'Флокс', 'Жовтець', 'Зірка', 'Роза']

for plant in plants_list:
    plant[1] = replacements.get(plant[1], plant[1])  
    plant[2] = categories.index(plant[2].capitalize()) + 1
    plant.append(suppliers[plants_list.index(plant)])

#print(plants_list[0])

def add_task(conn, task):
    sql = '''INSERT INTO content_plant(plant_name, category, genus_id, plant_description, price, quantity_in_stock, supplier_id)
             VALUES(?,?,?,?,?,?,?)'''
    cur = conn.cursor()
    cur.execute(sql, task)
    conn.commit()
    cur.close()

with sqlite3.connect('db.sqlite3') as conn:
    for i in range(0, len(plants_list)):
        add_task(conn, plants_list[i]) 
conn.close()
